


using System.Collections.Generic;
using System.ComponentModel.Design;
using System.Runtime.InteropServices;
using System.Text;

namespace Lesson
{
    public class Program
    {




        public static void Main()  // точка входа в программу, программа стартует с этой функции (метода)

        {
            try
            {



               

                            // Завдання: (надіслати мені в лс)
                            //1.Написати програму, яка обчислює прибуток фірми за 6 місяців.Користувач запроваджує прибуток фірми за кожен місяць.
                            //2.Користувач вводить прибуток фірми протягом року(12 місяців).Необхідно визначити місяць, у якому прибуток був максимальний і місяць, у якому прибуток був мінімальний.
                            //3.Стиснути(зрушити елементи) масив, видаливши з нього всі 0, і заповнити елементи, що звільнилися праворуч, значеннями - 1. (Потрібно зробити через перестворення масиву)
                            //4.Cтворити матрицю 10 на 10, заповнити рандомними значеннями від 10 до 99
                   

               

            }
            catch { }
        }

    }

        
}   
            

